# GetDomainData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GenericZone..::..GetDomainData Method
GenericZone Class See Also
---
Gets the domain data for the generic zone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public GenericZoneDomainData GetDomainData()
```

Visual Basic
---
```text
Public Function GetDomainData As GenericZoneDomainData
```

Visual C++
---
```text
public:
GenericZoneDomainData^ GetDomainData()
```

# ### Return Value
Returns a pointer to the base class for specific domain requirements for the generic zone.
# See Also
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace